wegam/STM32F1xWorkSpace/Examples/HC/PL012V20.C
	SWITCHID.SW8_PORT	=	GPIOB;
	SWITCHID.SW8_Pin	=	GPIO_Pin_13;
	
	SwitchIdInitialize(&SWITCHID);							//
	
//	SwitchID	=	SWITCHID_Read(&SWITCHID);		//
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void SwitchID_Server(void)
{
	u8 temp=0;	//拔码开关临时地址
	temp	=	SWITCHID_Read(&SWITCHID);		//读取地址
	if(SwitchID	!=	temp)
	{
		u8 AddrH	=	0,AddrL	=	0;
		u32	w=0,n=0,d=0;
//	w	=	1;n	=	0;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
		
		w	=	12345678;
		LCD_Printf(0		,0	,32	,0,"序号：");				//待发药槽位，后边的省略号就是可变参数
		LCD_Printf(0		,32	,32	,0,"拔码：");				//待发药槽位，后边的省略号就是可变参数
		LCD_Printf(96	,0	,32	,0,"%8d",w);				//待发药槽位，后边的省略号就是可变参数
		w	=	0;
		SwitchID	=	temp;
		for(n=0;n<8;n++)
		{
			if((temp&0x01)	==0x01)
			{
				d	=	1;
			}
			else
			{
				d	=	0;
			}
			temp>>=1;
			LCD_Printf(n*16+96		,32	,32	,0,"%d",d);				//待发药槽位，后边的省略号就是可变参数
		}
		AddrH	=	(SwitchID>>4)&0x0F;
		AddrL	=	(SwitchID>>0)&0x0F;
		LCD_Printf(0		,64	,32	,0,"层%0.2d，位%0.2d",AddrH,AddrL);				//待发药槽位，后边的省略号就是可变参数
	}
}



/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void R61509V_Configuration(void)
{

	//=======================LCD端口
	LCDPortDef	*LcdPort	=	&sLCD.Port;
	
	LcdPort->sCS_PORT	=	GPIOB;
	LcdPort->sCS_Pin	=	GPIO_Pin_7;

	LcdPort->sDC_PORT	=	GPIOB;
	LcdPort->sDC_Pin	=	GPIO_Pin_6;
	
	LcdPort->sWR_PORT	=	GPIOB;
	LcdPort->sWR_Pin	=	GPIO_Pin_8;
	
	LcdPort->sRD_PORT	=	GPIOB;
	LcdPort->sRD_Pin	=	GPIO_Pin_5;
	
	LcdPort->sREST_PORT	=	GPIOB;
	LcdPort->sREST_Pin	=	GPIO_Pin_9;
	
	LcdPort->sBL_PORT		=	GPIOB;
	LcdPort->sBL_Pin		=	GPIO_Pin_0;
	
	LcdPort->sTE_PORT		=	GPIOB;
	LcdPort->sTE_Pin		=	GPIO_Pin_4;
	
	LcdPort->sDATABUS_PORT	=	GPIOC;
	LcdPort->sDATABUS_Pin		=	GPIO_Pin_All;
	
	sLCD.Data.BColor	=	LCD565_BLACK;
	sLCD.Data.PColor	=	LCD565_WHITE;
	sLCD.Flag.Rotate	=	Draw_Rotate_90D;
	
	//=======================字库端口
	sLCD.GT32L32.SPI.Port.SPIx	=	SPI1;
	sLCD.GT32L32.SPI.Port.CS_PORT	=	GPIOA;
	sLCD.GT32L32.SPI.Port.CS_Pin		=	GPIO_Pin_4;
	sLCD.GT32L32.SPI.Port.SPI_BaudRatePrescaler_x=SPI_BaudRatePrescaler_2;

	R61509V_Initialize(&sLCD);
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void ILI9326_Configuration(void)
{

	//=======================LCD端口
	LCDPortDef	*LcdPort	=	&sLCD.Port;
	
	LcdPort->sCS_PORT		=	GPIOB;
	LcdPort->sCS_Pin		=	GPIO_Pin_7;

	LcdPort->sDC_PORT		=	GPIOB;
	LcdPort->sDC_Pin		=	GPIO_Pin_6;
	
	LcdPort->sWR_PORT		=	GPIOB;
	LcdPort->sWR_Pin		=	GPIO_Pin_8;
	
	LcdPort->sRD_PORT		=	GPIOB;
	LcdPort->sRD_Pin		=	GPIO_Pin_5;
	
	LcdPort->sREST_PORT	=	GPIOB;
	LcdPort->sREST_Pin	=	GPIO_Pin_9;
	
	LcdPort->sBL_PORT		=	GPIOB;
	LcdPort->sBL_Pin		=	GPIO_Pin_0;
	
	LcdPort->sTE_PORT		=	GPIOB;
	LcdPort->sTE_Pin		=	GPIO_Pin_4;
	
	LcdPort->sDATABUS_PORT	=	GPIOC;
	LcdPort->sDATABUS_Pin		=	GPIO_Pin_All;
	
	sLCD.Data.BColor	=	LCD565_BLACK;
	sLCD.Data.PColor	=	LCD565_RED;
	sLCD.Flag.Rotate	=	Draw_Rotate_90D;
	
	//=======================字库端口
	sLCD.GT32L32.SPI.Port.SPIx			=	SPI1;
	sLCD.GT32L32.SPI.Port.CS_PORT		=	GPIOA;
	sLCD.GT32L32.SPI.Port.CS_Pin		=	GPIO_Pin_4;
	sLCD.GT32L32.SPI.Port.SPI_BaudRatePrescaler_x=SPI_BaudRatePrescaler_8;

	ILI9326_Initialize(&sLCD);
}


/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void RS485_Configuration(void)
{
	RS485.USARTx=USART2;
	RS485.RS485_CTL_PORT=GPIOA;
	RS485.RS485_CTL_Pin=GPIO_Pin_1;
	
	RS485_DMA_ConfigurationNR	(&RS485,19200,256);	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
}
/*******************************************************************************
* 函数名		:	
* 功能描述	:	 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
void LCD_PowerUp(void)
{	
//	u16 i=0,j=0;
	
	
	
	
	
//	R61509V_DrawDot(50,50,0X5458);
//	R61509V_DrawDot_big(50,50,0X5458);
//	R61509V_DrawLine(0,0,240,400,0X5458);
//	R61509V_DrawLine(0,400,240,0,0X5458);
	
//	R61509V_DrawCircle(120,100, 50,0,0X5458);				//画一个圆形框
	
//	R61509V_DrawCircle(120,200, 120,0,0X01CF);				//画一个圆形框
	
//	R61509V_DrawCircle(120,400, 80,0,0X5458);				//画一个圆形框
//	
//	R61509V_DrawCircle(120,0, 80,0,0X5458);					//画一个圆形框
//	
//	R61509V_DrawCircle(120,200, 80,1,0X5458);				//画一个圆形框
//	
//	R61509V_DrawCircle(200,120, 50,0,0xF800);				//画一个圆形框
//	
//	R61509V_DrawCircle(120,200, 30,1,0X07FF);				//画一个圆形框
	
//	R61509V_DrawRectangle(3,3,237,397,0x07E0);			//画一个矩形框
//	R61509V_DrawRectangle(4,4,236,396,0x07E0);			//画一个矩形框
//	R61509V_DrawRectangle(5,5,235,395,0x07E0);			//画一个矩形框
//	R61509V_DrawRectangle(6,6,234,394,0x07E0);			//画一个矩形框
//	
//	R61509V_DrawRectangle(7,7,233,393,0X07FF);			//画一个矩形框
//	R61509V_DrawRectangle(8,8,232,392,0X07FF);			//画一个矩形框
//	R61509V_DrawRectangle(9,9,231,391,0X07FF);			//画一个矩形框
//	R61509V_DrawRectangle(10,10,230,390,0X07FF);		//画一个矩形框
//	R61509V_DrawRectangle(11,11,229,389,0X07FF);		//画一个矩形框
//	R61509V_DrawRectangle(12,12,228,388,0X07FF);			//画一个矩形框
//	R61509V_DrawLine(12,12,228,388,0X5458);						//AB 两个坐标画一条直线
//	R61509V_DrawLine(12,388,228,12,0X5458);						//AB 两个坐标画一条直线
	
//	R61509V_DrawLine(0,10,400,10,0X5458);						//AB 两个坐标画一条直线
//	
//	R61509V_DrawLine(0,20,400,20,0X5458);						//AB 两个坐标画一条直线
	
