wegam/STM32F1xWorkSpace/Examples/HC/PL012V20.C
	}
	else if(RxNum==6&&RevBuffe[0]==0x81)	//槽位信息0x01--获取,0x81--上报
	{
		Onlinede=RevBuffe[4];
	}
	else if(RxNum==1&&RevBuffe[0]==0x01)	//槽位信息0x01--获取,0x81--上报
	{
		LCD_Printf(0		,120	,16		,0,"获取槽位信息！！！");				//错误状态
		NumFW=0;
		Onlinede=0;
		memset(SumFed,0x00,8);
		memset(SumFQ,0x00,8);

		LCD_Printf(96		,0	,16	,0,"%2d",0);				//待发药槽位，后边的省略号就是可变参数
		LCD_Printf(96		,20	,16	,0,"%2d",0);				//待发药数量，后边的省略号就是可变参数
	}
	
	for(DelayTime=0;DelayTime<1000;DelayTime++)
	{
		
	}
	if(RxNum&&(RevBuffe[0]==0x82))		//错误状态显示
	{
		switch(RevBuffe[3])
		{
			case 0x00:	LCD_Printf(0		,120	,16	,0,"！！！！！！！！！！！！！！");				//错误状态
				break;
			case 0x80:	LCD_Printf(0		,120	,16	,0,"药品被卡住！！！！！！！！！");				//错误状态
				break;
			case 0x81:	LCD_Printf(0		,120	,16	,0,"缺药！！！！！！！！！！！！");				//错误状态
				break;
			case 0x82:	LCD_Printf(0		,120	,16	,0,"等待命令结果超时！！！！！！");				//错误状态
				break;
			case 0xC0:	LCD_Printf(0		,120	,16	,0,"单元柜控制器通信异常！！！！");				//错误状态
				break;
			case 0xC1:	LCD_Printf(0		,120	,16	,0,"发药层控制器通信异常！！！！");				//错误状态
				break;
		}
//		RevBuffe[0]=0;
//		RevBuffe[1]=0;
//		RevBuffe[2]=0;
//		RevBuffe[3]=0;
	}
#endif
}

/*******************************************************************************
* 函数名		:	
* 功能描述	:	 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
void PL010V13_DISPLAY(void)
{
//	R61509V_DrawPixelEx( 100, 100,LCD_FORE_COLOR);
//	R61509V_DrawHLine( 10, 100, 200, LCD_FORE_COLOR);
}
void PL010Delay(u32 time)
{	
	while(time--);
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void LCD_WS(void)		//位闪烁
{
	if(NumFW)		//槽位闪烁	DSPTime
	{
		if(NumFW==1&&(Onlinede>>0&0x01))
		{
			if(DSPTime==500)
			{
				LCD_Fill(2,180,50,200-2,LCD565_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
			}
			else if(DSPTime==250)
			{
				LCD_Fill(2,180,50,200-2,LCD565_MAGENTA);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
			}
		}
		else if(NumFW==2&&(Onlinede>>1&0x01))
		{
			if(DSPTime==500)
			{
				LCD_Fill(52,180,100,200-2,LCD565_GBLUE);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
			}
			else if(DSPTime==250)
			{
				LCD_Fill(52,180,100,200-2,LCD565_MAGENTA);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
			}			
		}
		else if(NumFW==3&&(Onlinede>>2&0x01))
		{
			if(DSPTime==500)
			{
				LCD_Fill(102,180,150,200-2,LCD565_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
			}
			else if(DSPTime==250)
			{
				LCD_Fill(102,180,150,200-2,LCD565_MAGENTA);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
			}			
		}
		else if(NumFW==4&&(Onlinede>>3&0x01))
		{
			if(DSPTime==500)
			{
				LCD_Fill(152,180,200,200-2,LCD565_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
			}
			else if(DSPTime==250)
			{
				LCD_Fill(152,180,200,200-2,LCD565_MAGENTA);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
			}			
		}
		else if(NumFW==5&&(Onlinede>>4&0x01))
		{
			if(DSPTime==500)
			{
				LCD_Fill(202,180,250,200-2,LCD565_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
			}
			else if(DSPTime==250)
			{
				LCD_Fill(202,180,250,200-2,LCD565_MAGENTA);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
			}			
		}
		else if(NumFW==6&&(Onlinede>>5&0x01))
		{
			if(DSPTime==500)
			{
				LCD_Fill(252,180,300,200-2,LCD565_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
			}
			else if(DSPTime==250)
			{
				LCD_Fill(252,180,300,200-2,LCD565_MAGENTA);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
			}			
		}
		else if(NumFW==7&&(Onlinede>>6&0x01))
		{
			if(DSPTime==500)
			{
				LCD_Fill(302,180,350,200-2,LCD565_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
			}
			else if(DSPTime==250)
			{
				LCD_Fill(302,180,350,200-2,LCD565_MAGENTA);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
			}			
		}
		else if(NumFW==8&&(Onlinede>>7&0x01))
		{
			if(DSPTime==500)
			{
				LCD_Fill(352,180,400-2,200-2,LCD565_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
			}
			else if(DSPTime==250)
			{
				LCD_Fill(352,180,400-2,200-2,LCD565_MAGENTA);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
			}			
		}
	}
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void LCD_WXS(void)		//位显示
{
		if((Onlinede>>0&0x01)==0x01)
		{
			LCD_Fill(2,180,50,200-2,LCD565_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		}
		else
		{
			LCD_Fill(2,180,50,200-2,LCD565_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		}
		if((Onlinede>>1&0x01)==0x01)
		{
			LCD_Fill(52,180,100,200-2,LCD565_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		}
		else
		{
			LCD_Fill(52,180,100,200-2,LCD565_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		}
		if((Onlinede>>2&0x01)==0x01)
		{
			LCD_Fill(102,180,150,200-2,LCD565_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		}
		else
		{
			LCD_Fill(102,180,150,200-2,LCD565_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		}
		if((Onlinede>>3&0x01)==0x01)
		{
			LCD_Fill(152,180,200,200-2,LCD565_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		}
		else
		{
			LCD_Fill(152,180,200,200-2,LCD565_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		}
		if((Onlinede>>4&0x01)==0x01)
		{
			LCD_Fill(202,180,250,200-2,LCD565_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		}
		else
		{
			LCD_Fill(202,180,250,200-2,LCD565_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		}
		if((Onlinede>>5&0x01)==0x01)
		{
			LCD_Fill(252,180,300,200-2,LCD565_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		}
		else
		{
			LCD_Fill(252,180,300,200-2,LCD565_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		}
		if((Onlinede>>6&0x01)==0x01)
		{
			LCD_Fill(302,180,350,200-2,LCD565_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		}
		else
		{
			LCD_Fill(302,180,350,200-2,LCD565_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		}
		if((Onlinede>>7&0x01)==0x01)
		{
			LCD_Fill(352,180,400-2,200-2,LCD565_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		}
		else
		{
			LCD_Fill(352,180,400-2,200-2,LCD565_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		}
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void LCD_DDSP(void)		//显示总共请求数量和已发数量
{
//	u8 i=0;
//	u8 w=2;
	//请求数量显示
//	for(i=0;i<8;i++)
//	{
//		PL010V13_PrintfString(w,200,16	,"%5d",SumFQ[i]);				//待发药数量，后边的省略号就是可变参数
//		w+=50;
//	}
	//请求数量显示
	LCD_Printf(2,200,16	,0,"%5d",SumFQ[0]);				//待发药数量，后边的省略号就是可变参数
	LCD_Printf(52,200,16	,0,"%5d",SumFQ[1]);				//待发药数量，后边的省略号就是可变参数
	LCD_Printf(102,200,16	,0,"%5d",SumFQ[2]);				//待发药数量，后边的省略号就是可变参数
	LCD_Printf(152,200,16	,0,"%5d",SumFQ[3]);				//待发药数量，后边的省略号就是可变参数
	LCD_Printf(201,200,16	,0,"%5d",SumFQ[4]);				//待发药数量，后边的省略号就是可变参数
	LCD_Printf(251,200,16	,0,"%5d",SumFQ[5]);				//待发药数量，后边的省略号就是可变参数
	LCD_Printf(301,200,16	,0,"%5d",SumFQ[6]);				//待发药数量，后边的省略号就是可变参数
	LCD_Printf(351,200,16	,0,"%5d",SumFQ[7]);				//待发药数量，后边的省略号就是可变参数

	//已发数量显示	
	LCD_Printf(2,220,16		,0,"%5d",SumFed[0]);				//待发药数量，后边的省略号就是可变参数
	LCD_Printf(52,220,16,0,"%5d",SumFed[1]);				//待发药数量，后边的省略号就是可变参数
	LCD_Printf(102,220,16	,0,"%5d",SumFed[2]);				//待发药数量，后边的省略号就是可变参数
	LCD_Printf(152,220,16	,0,"%5d",SumFed[3]);				//待发药数量，后边的省略号就是可变参数
	LCD_Printf(201,220,16	,0,"%5d",SumFed[4]);				//待发药数量，后边的省略号就是可变参数
	LCD_Printf(251,220,16	,0,"%5d",SumFed[5]);				//待发药数量，后边的省略号就是可变参数
	LCD_Printf(301,220,16	,0,"%5d",SumFed[6]);				//待发药数量，后边的省略号就是可变参数
	LCD_Printf(351,220,16	,0,"%5d",SumFed[7]);				//待发药数量，后边的省略号就是可变参数
}
#endif
